ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0gx218_gx207/TIMG8_1.0.xml
        <register id="TIMG8_CCCTL_23" width="32" offset="0x38" instances="2" instaddr="0x4" description="Capture or Compare Control Registers 2/3">
            <bitfield id="CCOND" description="Capture Condition. #br# Specifies the condition that generates a capture pulse. 4h-Fh = Reserved" begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="NOCAPTURE" value="0x0" description="None (never captures)"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ACOND" description="Advance Condition. #br# Specifies the condition that generates an advance pulse. 6h-Fh = Reserved" begin="6" end="4" width="3" rwaccess="R/W">
                <bitenum id="TIMCLK" value="0x0" description="Each TIMCLK"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
                <bitenum id="CC_TRIG_HIGH" value="0x5" description="CCP High or Trigger assertion (level)"/>
            </bitfield>
            <bitfield id="LCOND" description="Load Condition. #br# Specifies the condition that generates a load pulse.  4h-Fh = Reserved" begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_NO_EFFECT" value="0x0" description="CCP edges have no effect"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ZCOND" description="Zero Condition. #br# This field specifies the condition that generates a zero pulse. 4h-Fh = Reserved" begin="14" end="12" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_NO_EFFECT" value="0x0" description="CCP edges have no effect"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="COC" description="Capture or Compare. #br# Specifies whether the corresponding CC register is used as a capture register or a compare register (never both)." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="COMPARE" value="0x0" description="Compare"/>
                <bitenum id="CAPTURE" value="0x1" description="Capture"/>
            </bitfield>
            <bitfield id="SCERCNEZ" description="Suppress Compare Event if Repeat Counter is Not Equal to Zero
This bit suppresses the generation of the compare (CCD, CCU and RC) events from
the counter when the repeat counter (RCn) value is not 0." begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="CCD, CCU and RC events are always generated from the counter when their conditions are generated."/>
                <bitenum id="ENABLED" value="0x1" description="CCD, CCU and RC events are generated from the counter when their conditions are generated and the RC register value is 0."/>
            </bitfield>
            <bitfield id="CCUPD" description="Capture and Compare Update Method
This field controls how updates to the shadow
capture and compare register are performed
(when operating in compare mode, COC=0)." begin="20" end="18" width="3" rwaccess="R/W">
                <bitenum id="Immediately" value="0x0" description="Writes to the CCx_y register is written to the register directly and has immediate effect."/>
                <bitenum id="Zero_EVT" value="0x1" description="Following a zero event (CTR=0) Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0."/>
                <bitenum id="Compare_Down_EVT" value="0x2" description="Following a CCD event (CTR=CC_xy) Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="Compare_UP_EVT" value="0x3" description="Following a CCU event (CTR=CC_xy) Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="ZERO_LOAD_EVT" value="0x4" description="Following a zero or load event Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations."/>
                <bitenum id="ZERO_RC_ZERO_EVT" value="0x5" description="Following a zero event (CTR=0) with repeat count also zero (RC=0).  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0."/>
                <bitenum id="TRIG" value="0x6" description="Following a TRIG pulse.  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y #xD;
0."/>
            </bitfield>
            <bitfield id="CCACTUPD" description="CCACT shadow register Update Method
This field controls how updates to the CCCACT shadow register are performed" begin="28" end="26" width="3" rwaccess="R/W">
                <bitenum id="Immediately" value="0x0" description="Value written to the CCACTx_y register has immediate effect."/>
                <bitenum id="Zero_EVT" value="0x1" description="Following a zero event (CTR=0) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0."/>
                <bitenum id="Compare_Down_EVT" value="0x2" description="Following a CCD event (CTR=CC_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="Compare_UP_EVT" value="0x3" description="Following a CCU event (CTR=cc_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="ZERO_LOAD_EVT" value="0x4" description="Following a zero event (CTR=0) or load event (CTR=LOAD) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations."/>
                <bitenum id="ZERO_RC_ZERO_EVT" value="0x5" description="Following a zero event (CTR=0) with repeat count also zero (RC=0).  Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0."/>
                <bitenum id="TRIG" value="0x6" description="On a TRIG pulse, the value stored in CCACTx_y shadow register is loaded into CCACTx_y active register."/>
            </bitfield>
            <bitfield id="CC2SELU" description="Selects the source second CCU event." begin="24" end="22" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCU0" value="0x0" description="Selects CCU from CC0."/>
                <bitenum id="SEL_CCU1" value="0x1" description="Selects CCU from CC1."/>
                <bitenum id="SEL_CCU2" value="0x2" description="Selects CCU from CC2."/>
                <bitenum id="SEL_CCU3" value="0x3" description="Selects CCU from CC3."/>
                <bitenum id="SEL_CCU4" value="0x4" description="Selects CCU from CC4."/>
                <bitenum id="SEL_CCU5" value="0x5" description="Selects CCU from CC5."/>
            </bitfield>
            <bitfield id="CC2SELD" description="Selects the source second CCD event." begin="31" end="29" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCD0" value="0x0" description="Selects CCD from CC0."/>
                <bitenum id="SEL_CCD1" value="0x1" description="Selects CCD from CC1."/>
                <bitenum id="SEL_CCD2" value="0x2" description="Selects CCD from CC2."/>
                <bitenum id="SEL_CCD3" value="0x3" description="Selects CCD from CC3."/>
                <bitenum id="SEL_CCD4" value="0x4" description="Selects CCD from CC4."/>
                <bitenum id="SEL_CCD5" value="0x5" description="Selects CCD from CC5."/>
            </bitfield>
        </register>
        <register id="TIMG8_CCCTL_45" width="32" offset="0x40" instances="2" instaddr="0x4" description="Capture or Compare Control Registers 4/5">
            <bitfield id="SCERCNEZ" description="Suppress Compare Event if Repeat Counter is Not Equal to Zero
This bit suppresses the generation of the compare (CCD, CCU and RC) events from
the counter when the repeat counter (RC) value is not 0." begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="CCD, CCU and RC events are always generated from the counter when their conditions are generated."/>
                <bitenum id="ENABLED" value="0x1" description="CCD, CCU and RC events are generated from the counter when their conditions are generated and the RC register value is 0."/>
            </bitfield>
            <bitfield id="CCUPD" description="Capture and Compare Update Method
This field controls how updates to the shadow
capture and compare register are performed
(when operating in compare mode, COC=0)." begin="20" end="18" width="3" rwaccess="R/W">
                <bitenum id="Immediately" value="0x0" description="Writes to the CCx_y register is written to the register directly and has immediate effect."/>
                <bitenum id="Zero_EVT" value="0x1" description="Following a zero event (CTR=0) Writes to the CCx_y register are stored in shadow register and transferred to ECCx_y in the TIMCLK cycle following CTR equals 0."/>
                <bitenum id="Compare_Down_EVT" value="0x2" description="Following a CCD event (CTR=CC_xy) Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="Compare_UP_EVT" value="0x3" description="Following a CCU event (CTR=CC_xy) Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="ZERO_LOAD_EVT" value="0x4" description="Following a zero event (CTR=0) or load event (CTR=LOAD) Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LD.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations."/>
                <bitenum id="ZERO_RC_ZERO_EVT" value="0x5" description="Following a zero event (CTR=0) with repeat count also zero (RC=0).  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0."/>
                <bitenum id="TRIG" value="0x6" description="Following a TRIG pulse.  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y #xD;
0."/>
            </bitfield>
        </register>
        <register id="TIMG8_OCTL_01" width="32" offset="0x50" instances="2" instaddr="0x4" description="CCP Output Control Registers 0/1">
            <bitfield id="CCPOINV" description="CCP Output Invert The output as selected by CCPO is conditionally inverted." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NOINV" value="0x0" description="No inversion"/>
                <bitenum id="INV" value="0x1" description="Invert"/>
            </bitfield>
            <bitfield id="CCPIV" description="CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="LOW" value="0x0" description="Low"/>
                <bitenum id="HIGH" value="0x1" description="High"/>
            </bitfield>
            <bitfield id="CCPO" description="CCP Output Source" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="FUNCVAL" value="0x0" description="Signal generator value (for example, PWM, triggered PWM)"/>
                <bitenum id="LOAD" value="0x1" description="Load event"/>
                <bitenum id="CMPVAL" value="0x2" description="CCU event or CCD event"/>
                <bitenum id="ZERO" value="0x4" description="Zero event"/>
                <bitenum id="CAPCOND" value="0x5" description="Capture event"/>
                <bitenum id="FAULTCOND" value="0x6" description="Fault condition"/>
                <bitenum id="CC0_MIRROR_ALL" value="0x8" description="Mirror CCP of first capture and compare register to other capture compare blocks"/>
                <bitenum id="CC1_MIRROR_ALL" value="0x9" description="Mirror CCP of second capture and compare register in other capture compare blocks"/>
                <bitenum id="DEADBAND" value="0xC" description="Signal generator output after deadband insertion"/>
                <bitenum id="CNTDIR" value="0xD" description="Counter direction"/>
            </bitfield>
        </register>
        <register id="TIMG8_OCTL_23" width="32" offset="0x58" instances="2" instaddr="0x4" description="CCP Output Control Registers 2/3">
            <bitfield id="CCPOINV" description="CCP Output Invert The output as selected by CCPO is conditionally inverted." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NOINV" value="0x0" description="No inversion"/>
                <bitenum id="INV" value="0x1" description="Invert"/>
            </bitfield>
            <bitfield id="CCPIV" description="CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="LOW" value="0x0" description="Low"/>
                <bitenum id="HIGH" value="0x1" description="High"/>
            </bitfield>
            <bitfield id="CCPO" description="CCP Output Source" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="FUNCVAL" value="0x0" description="Signal generator value (for example, PWM, triggered PWM)"/>
                <bitenum id="LOAD" value="0x1" description="Load condition"/>
                <bitenum id="CMPVAL" value="0x2" description="CCU event or CCD event"/>
                <bitenum id="ZERO" value="0x4" description="Zero event"/>
                <bitenum id="CAPCOND" value="0x5" description="Capture event"/>
                <bitenum id="FAULTCOND" value="0x6" description="Fault Condition"/>
                <bitenum id="CC0_MIRROR_ALL" value="0x8" description="Mirror CCP of first capture and compare register in other capture compare blocks"/>
                <bitenum id="CC1_MIRROR_ALL" value="0x9" description="Mirror CCP of second capture and compare register in other capture compare blocksi /bn,."/>
                <bitenum id="DEADBAND" value="0xC" description="Deadband Inserted Output"/>
                <bitenum id="CNTDIR" value="0xD" description="Counter direction"/>
            </bitfield>
        </register>
        <register id="TIMG8_CCACT_01" width="32" offset="0x70" instances="2" instaddr="0x4" description="Capture or Compare Action Registers 0/1">
            <bitfield id="ZACT" description="CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="LACT" description="CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event." begin="4" end="3" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CDACT" description="CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down." begin="7" end="6" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CUACT" description="CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up." begin="10" end="9" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2DACT" description="CCP Output Action on CC2D event." begin="13" end="12" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2UACT" description="CCP Output Action on CC2U event." begin="16" end="15" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="FENACT" description="CCP Output Action on Fault Entry
This field describes the resulting action of the signal generator upon detecting a fault." begin="24" end="22" width="3" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
                <bitenum id="CCP_HIGHZ" value="0x4" description="CCP output value is tristated"/>
            </bitfield>
            <bitfield id="FEXACT" description="CCP Output Action on Fault Exit
This field describes the resulting action of the signal generator upon exiting the fault condition." begin="27" end="25" width="3" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
                <bitenum id="CCP_HIGHZ" value="0x4" description="CCP output value is tristated"/>
            </bitfield>
            <bitfield id="SWFRCACT" description="CCP Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
            </bitfield>
            <bitfield id="SWFRCACT_CMPL" description="CCP Complimentary output Action on Software Force Output

This field describes the resulting action of software force.

